CSI API ETABS v1
cFrameObj.SetLateralBracing Method
 Assigns a lateral bracing location to frame objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLateralBracing(
	string Name,
	int MyType,
	int Loc,
	double MyDist1,
	double MyDist2,
	bool RelDist = true,
	eItemType ItemType = eItemType.Objects
)
Function SetLateralBracing (
	Name As String,
	MyType As Integer,
	Loc As Integer,
	MyDist1 As Double,
	MyDist2 As Double,
	Optional RelDist As Boolean = true,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim MyType As Integer
Dim Loc As Integer
Dim MyDist1 As Double
Dim MyDist2 As Double
Dim RelDist As Boolean
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetLateralBracing(Name,
	MyType, Loc, MyDist1, MyDist2, RelDist,
	ItemType)
int SetLateralBracing(
	String^ Name,
	int MyType,
	int Loc,
	double MyDist1,
	double MyDist2,
	bool RelDist = true,
	eItemType ItemType = eItemType::Objects
)
abstract SetLateralBracing :
        Name : string *
        MyType : int *
        Loc : int *
        MyDist1 : float *
        MyDist2 : float *
        ?RelDist : bool *
        ?ItemType : eItemType
(* Defaults:
        let _RelDist = defaultArg RelDist true
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
MyType
Type: System.Int32
 This is 1 or 2, indicating the type of bracing.
Point bracing
Uniform bracing
Loc
Type: System.Int32
 This is 1, 2, or 3, indicating the bracing location.
Top
Bottom
All (top and bottom)
MyDist1
Type: System.Double
 When MyType is 1, this is the location of the point bracing. When MyType = 2, this is the location of the start of the uniform bracing. [L] when RelDist = False.
MyDist2
Type: System.Double
 This items is not used when MyType = 1. When MyType = 2, this is the location of the end of the uniform bracing. [L] when RelDist = False.
RelDist (Optional)
Type: System.Boolean
 If this item is True, MyDist1 and MyDist2 are relative distances, otherwise they are actual distances.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the lateral bracing location is successfully assigned, otherwise it returns a nonzero value.
Remarks
 Added in v1.31.
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'assign frame lateral bracing
   ret = SapModel.FrameObj.SetLateralBracing("65", 1, 3, 0.5, 0)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace